<script setup lang="ts">
    /* Vue Components */
    import Layout       from '@/components/LayoutAgree.vue'; /* Named Slot Outlet */
</script>


<template>
  <Layout>
    <template #mainText>
      <div class="TOU ja">
        <h1 class="title ja">利用規約</h1>
        <article class="introduction ja">
          <h2>適用</h2>
          <ol class="num">
            <li>本利用規約（以下「本規約」といいます。）は日本語を原本とし、翻訳された規約は参考の為のみとします。本規約の原本と翻訳での解釈に相違が判明した場合、本規約の解釈は原本によるものとします。</li>
            <li>本規約は、本ウェブサイトのサービスの提供条件及び本ウェブサイトの運営者と利用者との間の権利義務関係を定めています。</li>
            <li>本規約は、日本法に準拠し、同法に従い解釈されるものとします。本サービスに関して紛争が生じた場合には、運営者所在地を管轄する裁判所を専属的合意管轄とします。</li>
            <li>本サービスの利用に際しては、本規約及びプライバシーポリシーへの同意を必要とします。 ご利用の前に、必ず本規約の全文をお読みください。</li>
          </ol>
        </article>
        <article class="article1 ja">
          <h2>第1条 定義</h2>
          <ol class="num">
            <li>本規約において使用する以下の用語は、各々以下に定める意味を有するものとします。
              <ol type="i">
                <li>「本サービス」とは、本ウェブサイトで提供する、正式運用が開始された有料又は無料のサービスを意味します。（理由の如何を問わずサービスの名称又は内容が変更された場合は、当該変更後のサービスを含みます）</li>
                <li>「ベータテストサービス」とは、本ウェブサイトで提供する、テスト中の一部または全部のサービスを意味します。（理由の如何を問わずサービスの名称又は内容が変更された場合は、当該変更後のサービスを含みます）</li>
                <li>「利用契約」とは、本ウェブサイトと利用者の間で締結する、本サービスの利用契約を意味します。</li>
                <li>「本ウェブサイト」とは、そのドメインが「soulfree.jp」であるウェブサイト、及びそれに付随するウェブサイトを意味します。（理由の如何を問わず、運営者のウェブサイトのドメイン又は内容が変更された場合は、当該変更後のウェブサイトを含みます）</li>
                <li>「運営者」とは、本ウェブサイトの設営及び運用を担うオーナーを意味します。</li>
                <li>「利用者」とは、本ウェブサイトて提供しているサインイン方法を用いて利用登録を行なった個人及び法人を意味します</li>
                <li>「コンテンツ」とは、本サービスを通じて利用者が閲覧可能な文章・画像・動画をいいます。</li>
                <li>「知的財産権」とは、著作権、特許権、実用新案権、意匠権、商標権その他の知的財産権（それらの権利を取得し、又はそれらの権利につき登録等を出願する権利を含みます）を意味します。</li>
              </ol>
            </li>
          </ol>
        </article>
        <article class="article2 ja">
          <h2>第2条 本規約の変更</h2>
          <ol class="num">
            <li>運営者は、必要が生じたときに、民法第548条の4の規定に基づいて、本規約を適時変更することがあります。なお、この場合には、利用者の利用条件その他利用契約の内容は、変更後の新しい本規約を適用するものとします。</li>
            <li>運営者は、前項の変更を行う場合は、その旨及び変更後の規定の内容並びにその効力発生時期が到来するまでに、本ウェブサービス上に掲載する、もしくは電子メールの送信等の所定の方法により周知するものとします。但し、変更がベータテストサービスに関わる内容に限定する場合は、予告なく適時変更するものとします。</li>
            <li>本規約の変更は、運営者が別途定める場合を除いて，変更後の本本規約を本ウェブサイトに掲載した段階から効力が生じるものとします。</li>
          </ol>
        </article>
        <article cllass="article3 ja">
          <h2>第3条 利用登録</h2>
          <ol class="num">
            <li>本サービスにおいては、本規約に同意の上、運営者の定める方法によって利用登録を申請し、運営者がこれを承認することによって、利用登録が完了するものとします。</li>
            <li>運営者は、利用登録の申請者に以下の事由があると判断した場合、利用登録の申請を承認しないことがあり、その理由については一切の開示義務を負わないものとします。
              <ol type="i">
                <li>利用登録の申請に際して虚偽の事項を届け出た場合</li>
                <li>本規約に違反したことがある者からの申請である場合</li>
                <li>その他、運営者が利用登録を相当でないと判断した場合</li>
              </ol>
            </li>
          </ol>
        </article>
        <article class="article4 ja">
          <h2>第4条 利用料金および支払方法</h2>
            <ol class="num">
              <li>利用者は、本サービスの有料部分の対価として、運営者が別途定め、本ウェブサイトに表示する利用料金を運営者が指定する方法により支払うものとします。</li>
              <li>利用者がが利用料金の支払を遅滞した場合には、利用者は年14．6％の割合による遅延損害金を支払うものとします。</li>
            </ol>
        </article>
        <article class="article5 ja">
          <h2>第5条 禁止事項</h2>
            <ol class="num">
              <li>利用者は、本サービスの利用にあたり、以下の行為をしてはなりません。
                <ol type="i">
                  <li>法令または公序良俗に違反する行為</li>
                  <li>犯罪行為に関連する行為</li>
                  <li>本サービスの内容等、本サービスに含まれる著作権、商標権ほか知的財産権を侵害する行為</li>
                  <li>運営者、ほかの利用者、またはその他第三者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為</li>
                  <li>本サービスによって得られた情報を商業的に利用する行為</li>
                  <li>運営者のサービスの運営を妨害するおそれのある行為</li>
                  <li>不正アクセスをし、またはこれを試みる行為</li>
                  <li>他の利用者に関する個人情報等を収集または蓄積する行為</li>
                  <li>不正な目的を持って本サービスを利用する行為</li>
                  <li>本サービスの他の利用者またはその他の第三者に不利益、損害、不快感を与える行為</li>
                  <li>他の利用者に成りすます行為</li>
                  <li>運営者が許諾しない本サービス上での宣伝、広告、勧誘、または営業行為</li>
                  <li>面識のない異性との出会いを目的とした行為</li>
                  <li>運営者のサービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為</li>
                  <li>その他、運営者が不適切と判断する行為</li>
                </ol>
              </li>
            </ol>
        </article>
        <article class="article6 ja">
          <h2>第7条 利用制限および登録抹消</h2>
            <ol class="num">
              <li>運営者は、利用者が以下のいずれかに該当する場合には、事前の通知なく、利用者に対して、本サービスの全部もしくは一部の利用を制限し、または利用者としての登録を抹消することができるものとします。
                <ol type="i">
                  <li>本規約のいずれかの条項に違反した場合</li>
                  <li>登録事項に虚偽の事実があることが判明した場合</li>
                  <li>料金等の支払債務の不履行があった場合</li>
                  <li>運営者からの連絡に対し、一定期間返答がない場合</li>
                  <li>本サービスについて、最終の利用から一定期間利用がない場合</li>
                  <li>その他、運営者が本サービスの利用を適当でないと判断した場合</li>
                </ol>
              </li>
              <li>運営者は、本条に基づき運営者が行った行為により利用者に生じた損害について、一切の責任を負いません。</li>
            </ol>
        </article>
        <article class="article7 ja">
          <h2>第7条 サービスの停止</h2>
          <ol class="num">
            <li>運営者は、設備の点検や緊急の保守・点検作業などにより、運営者の判断で、いつでも本サービスおよびベータテストサービスの一部または全部を停止することができるものとします。</li>
          </ol>
        </article>
        <article class="rticle8 ja">
          <h2>第8条 サービスの変更及び終了</h2>
          <ol class="num">
            <li>運営者は、運営者の判断により、本サービスおよびベータテストサービスの全部または一部について、いつでも内容の変更、もしくは提供の終了を行うことができます。（特にベータテストサービスにおいては、自動的かつ予告なく変更されることがあるものとします。）</li>
            <li>運営者は、本サービスの開始する場合（ベータテストサービスからの移行を含む）、もしくは本サービスの提供を終了する場合、事前に利用者に対して通知するものとします。</li>
            <li>運営者は、本条に基づき運営者が行った措置に基づき利用者に生じた損害について一切の責任を負いません。</li>
          </ol>
        </article>
        <article class="article9 ja">
          <h2>第9条 免責事項</h2>
          <ol class="num">
            <li>本サービスは、利用者の特定の目的への適合性、安全性、信頼性、正確性、完全性を有すること、利用者による本サービスの利用が利用者に適用のある法令又は業界団体の内部規則等に適合すること、及びセキュリティなどに関する不具合が生じないことについて、何ら保証するものではありません。
            </li>
            <li>有料または無料のコンテンツに関わらず本ウェブサイトを利用すること、もしくは利用できなかったことに関して発生した損害について、運営者は一切責任を負いません。</li>
            <li>利用者は、自己の責任において、本ウェブサイトの登録に利用した利用者ID及びパスワードを適切に管理及び保管するものとし、これを第三者に利用させてはならないものとします。利用者ID及びパスワードの管理不十分、使用上の過誤、第三者の使用等によって生じた損害に関する責任は利用者が負うものとし、運営者は一切の責任を負いません。</li>
          </ol>
        </article>
      </div>
    </template>
    <template #agreeButton>
      利用規約に同意します
    </template>
  </Layout>
</template>

<style scoped>
  h1 {
    font-size: 1.5rem;
    font-weight: bold;
    text-align: center;
    margin-bottom: 2rem;
  }
  article {
    font-family: serif;
    margin-bottom: 2rem;
    /* max-width: 768px; */
  }
  h2 {
    line-height: 2rem;
    font-size: 1.2rem;
    font-weight: bold;
  }
  ul>li {
    line-height: normal;
    list-style-type: "- ";
    list-style-position: inside;
    padding-left: 1rem;
  }
  ul>li>ol>li, ol>li>ol>li{
    padding-left: 1rem;
  }
  ol>li {
    line-height: normal;
    list-style-position: inside;
  }
  ol.num>li{
    padding-left: 1rem;
  }
  li {
    text-indent: -1rem;
  }
  main.web-app {
    overflow-y: scroll;
  }
</style>
