<script setup lang="ts">
    /* Vue Components */
    import Layout from '@/components/LayoutAgree.vue'; /* Named Slot Outlet */
</script>


<template>
  <Layout>
    <template #mainText>
      <div class="fullText PrivacyPolicy ja">
        <h1 class="title ja">プライバシーポリシー</h1>
        <article class="introduction ja">
          <h2>適用</h2>
          <ol class="num">
            <li>本プライバシーポリシー（以下、「本ポリシー」といいます。）は日本語を原本とし、翻訳されたポリシーは参考の為のみとします。本ポリシーの原本と翻訳での解釈に相違が判明した場合、本ポリシーの解釈は原本によるものとします。</li>
            <li>本ポリシーは、運営者が本ウェブサイト上で提供するサービスにおける利用者の個人情報の取扱いについて定めるものです。</li>
          </ol>
        </article>
        <article class="article1 ja">
          <h2>第1条 定義</h2>
          <ol class="num">
            <li>本ポリシーにおいて使用する以下の用語は、各々以下に定める意味を有するものとします。
              <ol type="i">
                <li>「個人情報」とは、個人情報保護法にいう「個人情報」を指すものとし、生存する個人に関する情報であって、当該情報に含まれる氏名、生年月日、住所、電話番号、連絡先その他の記述等により特定の個人を識別できる情報及び容貌、指紋、声紋にかかるデータ及び健康保険証の保険者番号などの当該情報単体から特定の個人を識別できる情報（個人識別情報）を指します。</li>
                <li>「本サービス」とは、本ウェブサイトで提供する、正式運用が開始された有料又は無料のサービスを意味します。（理由の如何を問わずサービスの名称又は内容が変更された場合は、当該変更後のサービスを含みます）</li>
                <li>「ベータテストサービス」とは、本ウェブサイトで提供する、テスト中の一部または全部のサービスを意味します。（理由の如何を問わずサービスの名称又は内容が変更された場合は、当該変更後のサービスを含みます）</li>
                <li>「利用契約」とは、本ウェブサイトと利用者の間で締結する、本サービスの利用契約を意味します。</li>
                <li>「本ウェブサイト」とは、そのドメインが「soulfree.jp」であるウェブサイト、及びそれに付随するウェブサイトを意味します。（理由の如何を問わず、運営者のウェブサイトのドメイン又は内容が変更された場合は、当該変更後のウェブサイトを含みます）</li>
                <li>「運営者」とは、本ウェブサイトの設営及び運用を担うオーナーを意味します。</li>
                <li>「利用者」とは、本ウェブサイトて提供しているサインイン方法を用いて利用登録を行なった個人及び法人を意味します。</li>
              </ol>
            </li>
          </ol>
        </article>
        <article class="article2 ja">
          <h2>第2条 本ポリシーの変更</h2>
          <ol class="num">
            <li>運営者は、必要が生じたときに、本ポリシーを適時変更することがあります。</li>
            <li>本ポリシーの内容は、法令その他本ポリシーに別段の定めのある事項を除いて、利用者に通知することなく、変更することができるものとします。</li>
            <li>本ポリシーの変更は、運営者が別途定める場合を除いて、変更後の本ポリシーを本ウェブサイトに掲載した段階から効力が生じるものとします。</li>
          </ol>
        </article>
        <article cllass="article3 ja">
          <h2>第3条 個人情報を収集・利用する目的</h2>
          <ol class="num">
            <li>運営者が個人情報を収集・利用する目的は、以下のとおりです。
              <ol type="i">
                <li>本ウェブサイトでのサービスの提供・運営のため</li>
                <li>利用者からのお問い合わせに回答するため（本人確認を行うことを含む）</li>
                <li>サービスの停止、変更等のお知らせなど、必要に応じたご連絡を利用者へ送付するため</li>
                <li>利用ポリシーに違反した利用者や、不正・不当な目的でサービスを利用しようとする利用者の特定をし、ご利用をお断りするため</li>
                <li>利用者ご自身で、利用者の登録情報の閲覧や変更、削除、ご利用状況の確認を行っていただくため</li>
                <li>有料サービスにおいて、利用者に利用料金を請求するため</li>
                <li>上記の利用目的に付随する目的</li>
              </ol>
            </li> 
          </ol>
        </article>
        <article cllass="article4 ja">
          <h2>第4条 利用目的の変更</h2>
          <ol class="num">
            <li>運営者は、個人情報の利用目的が、変更前と関連性を有すると合理的に認められる場合に限り、個人情報の利用目的を変更するものとします。</li>
            <li>個人情報の利用目的の変更を行う場合には、変更後の目的について、電子メール等の所定の方法により、利用者に通知し、または本ウェブサイト上に公表するものとします。</li>
          </ol>
        </article>
        <article class="article5 ja">
          <h2>第5条 個人情報の第三者提供</h2>
          <ol class="num">
            <li>運営者は、次に掲げる場合を除いて、あらかじめ利用者の同意を得ることなく、第三者に個人情報を提供することはありません。ただし、個人情報保護法その他の法令で認められる場合を除きます。
              <ol type="i">
                <li>人の生命、身体または財産の保護のために必要がある場合であって、本人の同意を得ることが困難であるとき</li>
                <li>公衆衛生の向上または児童の健全な育成の推進のために特に必要がある場合であって、本人の同意を得ることが困難であるとき</li>
                <li>国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき</li>
                <li>予め次の事項を告知あるいは公表し、かつ運営者が個人情報保護委員会に届出をしたとき
                  <ol>
                    <li>利用目的に第三者への提供を含むこと</li>
                    <li>第三者に提供されるデータの項目</li>
                    <li>第三者への提供の手段または方法</li>
                    <li>本人の求めに応じて個人情報の第三者への提供を停止すること</li>
                    <li>本人の求めを受け付ける方法</li>
                  </ol>
                </li>
              </ol>
            </li>
            <li>前項の定めにかかわらず、次に掲げる場合には、当該情報の提供先は第三者に該当しないものとします。
              <ol type="i">
                <li>運営者が利用目的の達成に必要な範囲内において個人情報の取扱いの全部または一部を委託する場合</li>
                <li>合併その他の事由による事業の承継に伴って個人情報が提供される場合</li>
                <li>個人情報を特定の者との間で共同して利用する場合であって、その旨並びに共同して利用される個人情報の項目、共同して利用する者の範囲、利用する者の利用目的および当該個人情報の管理について責任を有する者の氏名または名称について、あらかじめ本人に通知し、または本人が容易に知り得る状態に置いた場合</li>
              </ol>
            </li>
          </ol>
        </article>
        <article class="article6 ja">
          <h2>第6条 個人情報の開示</h2>
          <ol class="num">
            <li>運営者は、本人から個人情報の開示を求められたときは、本人に対し、これを開示します。ただし、開示することにより次のいずれかに該当する場合は、その全部または一部を開示しないこともあります。
              <ol type="i">
                <li>本人または第三者の生命、身体、財産その他の権利利益を害するおそれがある場合</li>
                <li>運営者の業務の適正な実施に著しい支障を及ぼすおそれがある場合</li>
                <li>その他法令に違反することとなる場合</li>
              </ol>
            </li>
            <li>前項の定めにかかわらず、履歴情報および特性情報などの個人情報以外の情報については、原則として開示いたしません。</li>
          </ol>
        </article>
        <article class="article7 ja">
          <h2>第7条 個人情報の訂正、削除及び利用停止</h2>
          <ol class="num">
            <li>利用者は、運営者の保有する自己の個人情報が誤った情報である場合、運営者に対して個人情報の訂正、削除、利用停止を請求することができます。</li>
            <li>運営者は、利用者から前項の請求を受けてその請求に応じる必要があると判断した場合には、当該個人情報の訂正等を行うものとします。</li>
          </ol>
        </article>
      </div>
    </template>
    <template #agreeButton>
      プライバシーポリシーに同意します
    </template>
  </Layout>
</template>

<style scoped>
  h1 {
    font-size: 1.5rem;
    font-weight: bold;
    text-align: center;
    margin-bottom: 2rem;
  }
  article {
    font-family: serif;
    margin-bottom: 2rem;
    /* max-width: 768px; */
  }
  h2 {
    line-height: 2rem;
    font-size: 1.2rem;
    font-weight: bold;
  }
  ul>li {
    line-height: normal;
    list-style-type: "- ";
    list-style-position: inside;
    padding-left: 1rem;
  }
  ul>li>ol>li, ol>li>ol>li{
    padding-left: 1rem;
  }
  ol>li {
    line-height: normal;
    list-style-position: inside;
  }
  ol.num>li{
    padding-left: 1rem;
  }
  li {
    text-indent: -1rem;
  }
  main.web-app {
    overflow-y: scroll;
  }
</style>
